app/controllers/foods_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @food = Food.new
    @user = User.find(params[:user_id])

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Food"], ["measurement_unit", "78"], ["price", 1], ["quantity", 7], ["created_at", "2022-10-06 12:37:30.656348"], ["updated_at", "2022-10-06 12:37:30.656348"], ["user_id", 1]]
---
  def create
    @food = current_user.foods.new(food_params)
    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
---
  def destroy
    @food = Food.find(params[:id])
    if @food.destroy