app/controllers/public_recipes_controller.rb

  def index
    @recipes = Recipe.order('created_at DESC').where(public: true).includes(:user)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1 ORDER BY created_at ASC  [["public", true]]