app/controllers/recipes_controller.rb

  def update
    @recipe = Recipe.find(params[:id])
    @recipe.update(recipe_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "recipes" SET "public" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["public", true], ["updated_at", "2022-10-06 01:47:21.139934"], ["id", 3]]