app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
    @user = User.find(1)
---
SELECT "recipes".* FROM "recipes" ORDER BY created_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @recipe = current_user.recipes.new(recipe_params)
    if @recipe.save
---
INSERT INTO "recipes" ("name", "public", "created_at", "updated_at", "user_id", "preparation_time", "cooking_time", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @recipe = Recipe.find(params[:id])
    if @recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 7]]